In [29]:
import pandas as pd
# df=pd.read_csv('weather_csv')
student_data={
    'Name':['shaiksha','vivek','anil','kesava','sudhakar','abhisek'],
    'Maths':[78,57,35,98,56,73],
    'physcis':[67,98,23,45,87,99],
    'chemistry':[89,67,47,34,66,98],
    'biology':[99,56,73,34,67,23]       
}
df=pd.DataFrame(student_data)
df
# print(df)

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56
2      anil     35       23         47       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [30]:
df.loc[3]

Name         kesava
Maths            98
physcis          45
chemistry        34
biology          34
Name: 3, dtype: object

In [4]:
r,c=df.shape
df.shape

(6, 5)

In [5]:
df.count()

Name         6
Maths        6
physcis      6
chemistry    6
biology      6
dtype: int64

In [88]:
df.size

30

In [4]:
r

6

In [23]:
rows,columns

(6, 5)

In [24]:
df.head(2)

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56

In [25]:
df.tail(2)

       Name  Maths  physcis  chemistry  biology
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [27]:
df[2:5]#slicling 5 is not included

       Name  Maths  physcis  chemistry  biology
2      anil     35       23         47       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67

In [5]:
df.columns

Index(['Name', 'Maths', 'physcis', 'chemistry', 'biology'], dtype='object')

In [32]:
df.columns
# o/p:-Index(['Name', 'Maths', 'physcis', 'chemistry', 'biology'], dtype='object')

Index(['Name', 'Maths', 'physcis', 'chemistry', 'biology'], dtype='object')

In [7]:
# df.Name
df['Maths']

0    78
1    57
2    35
3    98
4    56
5    73
Name: Maths, dtype: int64

In [10]:
type(df['Name'][0])
# o/p:-pandas.core.series.Series

str

In [40]:
df[['Name','Maths']].head(2)

       Name  Maths
0  shaiksha     78
1     vivek     57

In [7]:
#max core in physcics
# df['physcis'].max()
#average
df['physcis'].mean()

69.83333333333333

In [8]:
#print the satistic in dataframe
df.describe()

           Maths    physcis  chemistry    biology
count   6.000000   6.000000   6.000000   6.000000
mean   66.166667  69.833333  66.833333  58.666667
std    21.720190  30.844232  24.227395  27.529378
min    35.000000  23.000000  34.000000  23.000000
25%    56.250000  50.500000  51.750000  39.500000
50%    65.000000  77.000000  66.500000  61.500000
75%    76.750000  95.250000  83.500000  71.500000
max    98.000000  99.000000  98.000000  99.000000

In [11]:
# df[df.Maths>35]
df["Maths"]>35

0     True
1     True
2    False
3     True
4     True
5     True
Name: Maths, dtype: bool

In [28]:
# # get the highest score in chemistry
# # df["chemistry"][df["chemistry"]==df["chemistry"].max()]
# # df[df.chemistry==df.chemistry.max()]
# #i want print specify column
# df[['Name','physcis']][df.chemistry==df.chemistry.max()]

df[["Maths","chemistry"]][df["physcis"]==df["physcis"].max()]

         Maths  chemistry
biology
23          73         98

In [17]:
#set index column
df.set_index('biology',inplace=True)

In [13]:
#fetch the data of the specific row
df.loc[3]

index             3
Name         kesava
Maths            98
physcis          45
chemistry        34
biology          34
Name: 3, dtype: object

In [11]:
#reset original function
df.reset_index(inplace=True)

In [8]:
df

          Maths  physcis  chemistry  biology
Name
shaiksha     78       67         89       99
vivek        57       98         67       56
anil         35       23         47       73
kesava       98       45         34       34
sudhakar     56       87         66       67
abhisek      73       99         98       23

In [9]:
df.set_index('Name',inplace=True)

KeyError: "None of ['Name'] are in the columns"

In [5]:
df

          Maths  physcis  chemistry  biology
Name
shaiksha     78       67         89       99
vivek        57       98         67       56
anil         35       23         47       73
kesava       98       45         34       34
sudhakar     56       87         66       67
abhisek      73       99         98       23

In [14]:
import pandas as pd
# df=pd.read_csv('weather_csv')
student_data={
    'Name':['shaiksha','vivek','anil','kesava','sudhakar','abhisek'],
    'Maths':[78,57,35,98,56,73],
    'physcis':[67,98,23,45,87,99],
    'chemistry':[89,67,47,34,66,98],
    'biology':[99,56,73,34,67,23]       
}
df=pd.DataFrame(student_data)
df
# print(df)

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56
2      anil     35       23         47       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [15]:
df["Name"]

0    shaiksha
1       vivek
2        anil
3      kesava
4    sudhakar
5     abhisek
Name: Name, dtype: object

In [17]:
df[["Name","Maths"]]

       Name  Maths
0  shaiksha     78
1     vivek     57
2      anil     35
3    kesava     98
4  sudhakar     56
5   abhisek     73

In [19]:
df["Maths"].max()
df["Maths"].min()

35

In [24]:
# df["Maths"]>55
# df[df["Maths"]>35]
df[df.Maths>35]

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

       Name  Maths
0  shaiksha     78
1     vivek     57
3    kesava     98
4  sudhakar     56
5   abhisek     73

In [67]:
# max,min
# df["Maths"].max()
df[df["Maths"]==df["Maths"].max()]
df["Maths"][df["Maths"]==df["Maths"].max()]
df[["Maths","chemistry"]][df["Maths"]==df["Maths"].max()]
df["Maths"][df["Maths"]>34]

0    78
1    57
2    35
3    98
4    56
5    73
Name: Maths, dtype: int64

In [83]:
# df.columns
# df.index
# df.index([1,2,3,4,5,6])
# df
# df.set_index("Maths",inplace=True)
# df
# df.set_index('chemistry',inplace=True)
# df
df.reset_index()
df.reset_index()

   chemistry      Name  physcis
0         89  shaiksha       67
1         67     vivek       98
2         47      anil       23
3         34    kesava       45
4         66  sudhakar       87
5         98   abhisek       99